_posts/2014-08-11-Using-org-mode-outside-of-Emacs---sort-of.html
---
title: Using org-mode outside of Emacs - sort of
date: 2014/08/11 20:22:43
updated: 2014/08/11 20:22:43
categories: emacs,orgmode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Extracting tables from an org-file</a></li>
<li><a href="#sec-2">2. Running code in an org-file</a></li>
</ul>
</div>
</div>
<p>
I recently posted about using Emacs for scripts (<a href="http://kitchingroup.cheme.cmu.edu/blog/2014/08/06/Writing-scripts-in-Emacs-lisp/">http://kitchingroup.cheme.cmu.edu/blog/2014/08/06/Writing-scripts-in-Emacs-lisp/</a> ). Someone was probably wondering, why would you do that, when you could use shell, python or perl? A good reason is to write scripts that can access data or code inside an org-file! This would allow you to leverage the extensive support for org-mode in Emacs, without a user necessarily even needing to use Emacs. Let us consider some examples. 
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Extracting tables from an org-file</h2>
<div class="outline-text-2" id="text-1">
<p>
If tables are named in org-mode, it is possible to extract the contents. Here is a table:
</p>

<table id="data-1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">x</th>
<th scope="col" class="right">y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">9</td>
</tr>
</tbody>
</table>

<p>
Another table might look like
</p>

<table id="data-2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">a</td>
<td class="right">b</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">8</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">27</td>
</tr>
</tbody>
</table>


<p>
It would be convenient to have a command-line utility that could extract the data from that table with a syntax like:
</p>

<div class="org-src-container">

<pre class="src src-sh">extract-org-table tblname orgfile --format lisp|csv|tab
</pre>
</div>


<p>
Here is one way to do it:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; org-table tblname orgfile lisp|csv|tab

(let ((tblname (pop command-line-args-left))
      (org-file (pop command-line-args-left))
      (format)
      (table)
      (content))
  (when command-line-args-left
    (setq format (pop command-line-args-left)))
  (find-file org-file)
  (setq table 
	(org-element-map (org-element-parse-buffer) 'table 
	  (lambda (element)
	    (when (string= tblname (org-element-property :name element))
	      element))
	  nil ;info
	  t )) ; first-match

  (unless table
    (error "no table found for %s" tblname))

  (when table
    (goto-char (org-element-property :contents-begin table))
    (let ((contents (org-table-to-lisp)))
      (if (string= format "lisp")
	  (print contents)
	;else      
	(dolist (row contents)
	  (unless (eq row 'hline)
	    (cond
	     ((string= format "csv")
	      (princ (mapconcat 'identity row ",")))
	     ((string= format "tab")
	      (princ (mapconcat 'identity row "\t")))
	     (t
	      (error "unsupported format: %s" format)))
	    (princ "\n")))))))
</pre>
</div>

<p>
Let us try it out. <a href="org-babel-tangle">org-babel-tangle</a>
</p>

<div class="org-src-container">

<pre class="src src-sh">./extract-org-table data-2 org-outside-emacs.org lisp
</pre>
</div>

<pre class="example">
(("a" "b") ("1" "1") ("2" "8") ("3" "27"))
</pre>

<div class="org-src-container">

<pre class="src src-sh">./extract-org-table data-1 org-outside-emacs.org csv
</pre>
</div>

<pre class="example">
x,y
1,1
2,4
3,9
</pre>

<div class="org-src-container">

<pre class="src src-sh">./extract-org-table data-2 org-outside-emacs.org tab
</pre>
</div>

<pre class="example">
a       b
1       1
2       8
3       27
</pre>

<p>
That looks pretty reasonable, and you could even pipe the output to another classic unix command like cut to get a single column. Let us get the second column here.
</p>

<div class="org-src-container">

<pre class="src src-sh">./extract-org-table data-1 org-outside-emacs.org csv | cut -d , -f 2
</pre>
</div>

<pre class="example">
y
1
4
9
</pre>

<p>
That is starting to look like using data from an org-file, but outside of org. Of course, we are using org-mode, via emacs, but the point is a user might not have to know that, as long as a fairly recent Emacs and org-mode was installed on their system.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Running code in an org-file</h2>
<div class="outline-text-2" id="text-2">
<p>
It may be that there is code in an org-file that you might want to use, but for some reason choose not to cut and paste from the org-file to some script. Here is a simple code block:
</p>

<div class="org-src-container">

<pre class="src src-python" id="python-block">import time
with open('results.dat', 'w') as f:
    f.write(time.asctime())
</pre>
</div>

<p>
To call this externally we have to find the block and then run it.
</p>


<div class="org-src-container">

<pre class="src src-emacs-lisp">;; org-run blockname org-file
;; run a code block in an org file
(let ((blockname (pop command-line-args-left))
      (org-file (pop command-line-args-left))
      (src))
  (find-file org-file)
  (setq src
	(org-element-map (org-element-parse-buffer) 'src-block
	  (lambda (element)
	    (when (string= blockname (org-element-property :name element))
	      element))
	  nil ;info
	  t )) ; first-match
  (when src
     (goto-char (org-element-property :begin src))
     ;; since we start with a fresh emacs, we have to configure some things.
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((python . t)))
     (let ((org-confirm-babel-evaluate nil))
       (org-babel-execute-src-block))))
</pre>
</div>

<p>
<a href="org-babel-tangle">org-babel-tangle</a>
</p>

<div class="org-src-container">

<pre class="src src-sh">./org-call.el python-block org-outside-emacs.org
cat results.dat
</pre>
</div>

<pre class="example">
Mon Aug 11 20:17:01 2014
</pre>

<p>
That demonstrates it is possible to call source blocks, but this is pretty limited in capability. You can only call a block; we did not capture any output from the block, only its side effects, e.g. it changed a file that we can examine. We have limited capability to set data into the block, other than through files. It might be possible to hack up something that runs org-babel-execute-src-block with constructed arguments that enables something like a var to be passed in. That is beyond today's post. When I get around to it, here is a reminder of how it might be possible to feed stdin to an emacs script: <a href="http://stackoverflow.com/questions/2879746/idomatic-batch-processing-of-text-in-emacs">http://stackoverflow.com/questions/2879746/idomatic-batch-processing-of-text-in-emacs</a> .
</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/08/11/Using-org-mode-outside-of-Emacs---sort-of.org">org-mode source</a><p><p>Org-mode version = 8.2.6</p>